src/Templates/advancecare/add_invoice.xml.j2

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{ username }}</wsse:Username>
        <wsse:Password>{{ password }}</wsse:Password>
        <wsse:Created>{{ created }}</wsse:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <ns2:addInvoiceNumberRequest xmlns:ns2="http://pt.advancecare.awsp.eligibilityAO">
      <InvoiceNumberParametersTO_1>
        <eligibilityNbr>{{ data.eligibilityNbr }}</eligibilityNbr>
        <memClinicId>{{ data.memClinicId }}</memClinicId>
        <userId>{{ data.userId }}</userId>
      </InvoiceNumberParametersTO_1>
    </ns2:addInvoiceNumberRequest>
  </soap:Body>
</soap:Envelope>

